{"config": [{"class_name": "Lambda", "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-e14d385437e5>\u00da\b<lambda>\t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "trainable": true, "name": "Normalization", "function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 1, "nb_row": 1, "nb_filter": 3, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 32, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_2", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 32, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_3", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_4", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_5", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 128, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_6", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activity_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "nb_filter": 128, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_7", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 512, "input_dim": 128, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 64, "input_dim": 512, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 16, "input_dim": 64, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": 16, "bias": true, "activation": "elu", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "W_regularizer": null}}], "keras_version": "1.2.0", "class_name": "Sequential"}